Revit 2027 API
CompoundStructureLayer.DeckEmbeddingType Property
 Embedding type for structural deck - only for a layer whose function is StructuralDeck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructDeckEmbeddingType DeckEmbeddingType { get; set; }
Public Property DeckEmbeddingType As StructDeckEmbeddingType
	Get
	Set
public:
property StructDeckEmbeddingType DeckEmbeddingType {
	StructDeckEmbeddingType get ();
	void set (StructDeckEmbeddingType value);
}
member DeckEmbeddingType : StructDeckEmbeddingType with get, set
Property Value
StructDeckEmbeddingType
 The default is StructDeckEmbeddingType.Invalid.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace